In [2]:
import pandas as pd
df = pd.read_csv("students.csv")
print(df)

    StudentID    Name  Class  Subject  Marks  Attendance
0         101   Aarav     10     Math   85.0        92.0
1         102    Neha     10  Science   92.0        88.0
2         103   Rahul     10     Math   78.0         NaN
3         104   Priya      9  Science   65.0        80.0
4         105   Karan      9     Math    NaN        70.0
5         106  Simran      9  English   88.0        90.0
6         107   Ankit     10  English   55.0        60.0
7         108   Pooja      9     Math   73.0         NaN
8         109   Rohit     10  Science   90.0        85.0
9         110   Sneha      9  English   82.0        95.0
10        111   Arjun     10     Math    NaN        78.0
11        112   Meera      9  Science   69.0         NaN

In [3]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StudentID   12 non-null     int64
 1   Name        12 non-null     object
 2   Class       12 non-null     int64
 3   Subject     12 non-null     object
 4   Marks       10 non-null     float64
 5   Attendance  9 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 708.0+ bytes

        StudentID      Class      Marks  Attendance
count   12.000000  12.000000  10.000000    9.000000
mean   106.500000   9.500000  77.700000   82.000000
std      3.605551   0.522233  12.055888   11.324752
min    101.000000   9.000000  55.000000   60.000000
25%    103.750000   9.000000  70.000000   78.000000
50%    106.500000   9.500000  80.000000   85.000000
75%    109.250000  10.000000  87.250000   90.000000
max    112.000000  10.000000  92.000000   95.000000

In [4]:
df[df["Marks"] > 80]

   StudentID    Name  Class  Subject  Marks  Attendance
0        101   Aarav     10     Math   85.0        92.0
1        102    Neha     10  Science   92.0        88.0
5        106  Simran      9  English   88.0        90.0
8        109   Rohit     10  Science   90.0        85.0
9        110   Sneha      9  English   82.0        95.0

In [5]:
df.sort_values("Marks", ascending=False)

    StudentID    Name  Class  Subject  Marks  Attendance
1         102    Neha     10  Science   92.0        88.0
8         109   Rohit     10  Science   90.0        85.0
5         106  Simran      9  English   88.0        90.0
0         101   Aarav     10     Math   85.0        92.0
9         110   Sneha      9  English   82.0        95.0
2         103   Rahul     10     Math   78.0         NaN
7         108   Pooja      9     Math   73.0         NaN
11        112   Meera      9  Science   69.0         NaN
3         104   Priya      9  Science   65.0        80.0
6         107   Ankit     10  English   55.0        60.0
4         105   Karan      9     Math    NaN        70.0
10        111   Arjun     10     Math    NaN        78.0

In [6]:
df["Subject"].value_counts()

Subject
Math       5
Science    4
English    3
Name: count, dtype: int64

In [10]:
print(df["Marks"].mean())
df["Marks"] = df["Marks"].fillna(df["Marks"].mean())
df

77.7

    StudentID    Name  Class  Subject  Marks  Attendance
0         101   Aarav     10     Math   85.0        92.0
1         102    Neha     10  Science   92.0        88.0
2         103   Rahul     10     Math   78.0         NaN
3         104   Priya      9  Science   65.0        80.0
4         105   Karan      9     Math   77.7        70.0
5         106  Simran      9  English   88.0        90.0
6         107   Ankit     10  English   55.0        60.0
7         108   Pooja      9     Math   73.0         NaN
8         109   Rohit     10  Science   90.0        85.0
9         110   Sneha      9  English   82.0        95.0
10        111   Arjun     10     Math   77.7        78.0
11        112   Meera      9  Science   69.0         NaN

In [12]:
df["Attendance"] = df["Attendance"].fillna(0)
df

    StudentID    Name  Class  Subject  Marks  Attendance
0         101   Aarav     10     Math   85.0        92.0
1         102    Neha     10  Science   92.0        88.0
2         103   Rahul     10     Math   78.0         0.0
3         104   Priya      9  Science   65.0        80.0
4         105   Karan      9     Math   77.7        70.0
5         106  Simran      9  English   88.0        90.0
6         107   Ankit     10  English   55.0        60.0
7         108   Pooja      9     Math   73.0         0.0
8         109   Rohit     10  Science   90.0        85.0
9         110   Sneha      9  English   82.0        95.0
10        111   Arjun     10     Math   77.7        78.0
11        112   Meera      9  Science   69.0         0.0

In [16]:
def res(x):
    if x>=50:
        return "Pass"
    else:
        return "Fail"
        
df["Result"] = df["Marks"].apply(res)
df

    StudentID    Name  Class  Subject  Marks  Attendance Result
0         101   Aarav     10     Math   85.0        92.0   Pass
1         102    Neha     10  Science   92.0        88.0   Pass
2         103   Rahul     10     Math   78.0         0.0   Pass
3         104   Priya      9  Science   65.0        80.0   Pass
4         105   Karan      9     Math   77.7        70.0   Pass
5         106  Simran      9  English   88.0        90.0   Pass
6         107   Ankit     10  English   55.0        60.0   Pass
7         108   Pooja      9     Math   73.0         0.0   Pass
8         109   Rohit     10  Science   90.0        85.0   Pass
9         110   Sneha      9  English   82.0        95.0   Pass
10        111   Arjun     10     Math   77.7        78.0   Pass
11        112   Meera      9  Science   69.0         0.0   Pass

In [17]:
df.groupby("Subject")["Marks"].mean()

Subject
English    75.00
Math       78.28
Science    79.00
Name: Marks, dtype: float64

In [18]:
df.to_csv("new_students.csv", index=False)